<template>
  <div class="fill-height">
    <app-banner title="Работа у нас" />

    <v-sheet tile color="grey lighten-5 fill-height grey--text text--darken-1">
      <v-container class="px-8 py-12">
        <v-row>
          <v-col cols="12" md="8" offset-md="2" lg="8" offset-lg="2">
            <p>
              Если вы молоды, активны и любите новые события, приглашаем вас
              стать частью нашей команды! Это позволит сменить обстановку и на
              время отвлечься от офиса или студенческой аудитории. Ни какого
              опыта не требуется, главное позитивный настрой и жедание дарить
              радость друг другу!
            </p>

            <h2 class="mb-4">Какие у нас есть позиции?</h2>

            <div v-for="(item, idx) in items" :key="idx">
              <div class="d-flex align-center">
                <h3>{{ item.title }}</h3>
                <v-chip
                  class="ma-2 red lighten-1"
                  text-color="white"
                  small
                  label
                >
                  Набора нет
                </v-chip>
              </div>

              <p>{{ item.text }}</p>
            </div>

            И естественно вознаграждение гарантировано! Если вы
            заинтересовались, оставляйте ваши контакты через форму или звоните
            по тел. <a :href="`tel:${tel}`">{{ tel }}</a> и мы расскажем обо
            всем подробнее.
          </v-col>
        </v-row>
      </v-container>
    </v-sheet>
  </div>
</template>

<script>
import AppBanner from '@/components/AppBanner.vue';
import { TEL } from '@/constants';

export default {
  name: 'Jobs',
  components: { AppBanner },
  data: () => ({
    tel: TEL,
    items: [
      {
        title: 'Судейство матчей',
        text:
          'Это основной и самый важный вид деятельности. Важно будет знать правила! Судей для проведения игры нужно больше чем в обычных спортивных состязаниях, до 6 человек, по-этому ждем ваших заявок!'
      },
      {
        title: 'Специалист по снежкам',
        text:
          'Конечно для игры нужно много снежков, по-этому это может оказаться отличной альтернативой спортивному залу. Конечно вам не придется делать 10 000 снежков подрят, игроки сами делают основную работу, но помощь им все равно нужна'
      },
      {
        title: 'Подсчет очков',
        text:
          'Так же нам нужен ответсвенный доброволец, который будет следить за подсчетом очков и за общим распределением команд'
      }
    ]
  })
};
</script>
