<template>
  <div class="fill-height">
    <app-banner :title="bannerTitle" :text="bannerText" />

    <v-sheet tile color="grey lighten-5 fill-height grey--text text--darken-1">
      <v-container class="px-8 py-12">
        <v-row>
          <v-col cols="12" md="8" offset-md="2" lg="8" offset-lg="2">
            <h2 class="mb-4">Основные правила</h2>

            <p>
              Снежный бой не делиться личной информацией любого рода ни с кем.
              Мы не будем продавать или сдавать в аренду Ваше имя или личные
              данные третьим лицам. Мы не продаем, не сдаем в аренду и не
              предоставляем доступ извне к нашему списку рассылки или любых
              данных, которые мы храним. Любые данные, которые пользователь
              оставляет у нас на сайте, находится в полной собственности его или
              бизнеса. В любое время пользователь может запросить удалить его
              личные данные.
            </p>

            <p>
              Снежный бой собирает только те данные с пользователей, которые
              необходимы для связи с ними и отправки им необходимой информации.
              Данная информация включает в себя, но не ограничивается этим,
              полное имя, почтовый адресс, телефонный номер.
            </p>

            <p>
              Снежный бой может предоставить личную информацию
              правоохранительным органам, если того требует закон. Мы также
              можем использовать личную информацию таким образом, чтобы не
              идентифицировать вас специально, или не связаться с Вами, но мы
              могли определять критерии о пользователях нашего сайта в целом
              (наример мы можеи использовать и передовать информацию 3-м лицам о
              количестве посещающих сайт пользователей или количестве подписок
              на электронные рассылки).
            </p>

            <h2 class="mt-8 mb-4">Изменения</h2>

            <p>
              Если мы изменим наши правила, мы напишем об этом на этой странице
              и обозночим новые или измененные пункты.
            </p>
          </v-col>
        </v-row>
      </v-container>
    </v-sheet>
  </div>
</template>

<script>
import AppBanner from '@/components/AppBanner.vue';

export default {
  name: 'Privacy',
  components: { AppBanner },
  data: () => ({
    bannerTitle: 'Политика конфиденциальности',
    bannerText:
      'Пожалуйста ознакомтесь с политикой конфиденциальности и остальными правилами.'
  })
};
</script>
