<template>
  <div class="fill-height">
    <app-banner :title="bannerTitle" :text="bannerText" />

    <v-sheet tile color="grey lighten-5 fill-height grey--text text--darken-1">
      <v-container class="px-8 py-12">
        <v-row>
          <v-col cols="12" md="8" offset-md="2" lg="8" offset-lg="2">
            <h2 class="mb-4">Выбор площадки</h2>

            <h3>Где можно построить корт?</h3>

            <p>
              Корт при благоприятных погодных условиях (при наличии снега) можно
              построить на территории 36м (32м для детей) на 10м, плюс требуется
              пространство для оборудования, зрителей и комфортного передвижения
              в целом.
            </p>

            <p>
              Также поблизости должен быть доступ к воде и электричеству (для
              строительства корта и самой игры электричество не нужно, а для,
              например, музыки и освещения пригодится).
            </p>

            <h3>Как проходит строительство?</h3>

            <p>
              Корт мы строим сами. Строительство нового корта занимает как
              минимум полдня, поэтому подготовить его нужно не позднее чем за
              день до мероприятия. Все необходимое оборудование для
              строительства у нас есть.
            </p>

            <h2 class="mt-8 mb-4">Проведение турнира</h2>

            <h3>Как готовимся мы?</h3>

            <p>
              В день проведения соревнований мы заранее подготавливаем все
              необходимое для проведения игр вместе со специалистами, которые
              предоставляют звук или кэйтеринг, если такие потребуются.
            </p>

            <h3>Как подготовиться вам?</h3>

            <p>
              Никакой особенной подготовки не требуется, для игры подойдет
              обычная зимняя одежда. Единственное правило — не надевать обувь с
              шипами.
            </p>

            <h2 class="mt-8 mb-4">Ход игры</h2>

            <h3>Как проходят игры?</h3>

            <p>
              Игры начинаются с краткого обзора правил и распределения команд по
              порядку.
            </p>
          </v-col>
        </v-row>
      </v-container>
    </v-sheet>
  </div>
</template>

<script>
import AppBanner from '@/components/AppBanner.vue';

export default {
  name: 'Questions',
  components: { AppBanner },
  data: () => ({
    bannerTitle: 'Вопросы',
    bannerText:
      'Сдесь вы найдете ответы на основные вопросы об игре и ее организации. Если Вы не нашли ответа на Ваш вопрос, пожалуйста позвоните нам или напишите, воспользовавшись формой для сообщений.',
  }),
};
</script>
